Revit 2024 API
CommandEventArgs.ActiveDocument Property
 The active document.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Document ActiveDocument { get; }
Visual Basic
Public ReadOnly Property ActiveDocument As Document
	Get
Visual C++
public:
property Document^ ActiveDocument {
	Document^ get ();
}
See Also
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace